// حدد إصدار المترجم الذي ستستخدمه
pragma solidity ^0.8.19;

// Example قم بإنشاء عقد بإسم
contract Examples {
    // State متغير يقوم بتخزين قيمة عددية نوعه
    uint public num;

    /**
        set دالة تحمل الاسم
        _num تأخذ عدداً صحيحاً بدون إشارة
        تم إنشائه كدالة عامة
        يمكن استدعاؤه من داخل العقد وكذلك خارجيًا لأنه عام
    */
    function set(uint _num) public {
        num = _num;
    }

    /**
        get دالة تحمل الاسم
        تقوم بإعادة عدداً صحيحاً بدون إشارة
        تم إنشائه كدالة عامة
        "view" الدوال التي يكون الغرض منها فقط قرأة متغير بحيث لا نغير من قيمته/حالته نجعله 
    */
    function get() public view returns (uint) {
        return num;
    }

    /**
        loop دالة تحمل الاسم
        تقوم بتشغيل حلقة دوران
        تحمل أيضاً شروط معينة اثناء عملية الدوران
    */
    function loop() public {
        // for حلقة دوران
        for (uint i = 0; i < 20; i++) {
            // الشروط
            if (i == 10) {
                // انتقل إلى التكرار التالي بالمتابعة
                continue;
            }
            if (i == 14) {
                // حلقة الخروج مع التوقف
                break;
            }
        }
    }
}
